work/ticket-system.org
#+TITLE:       完整的演出行业系统
#+AUTHOR:      enzo liu
#+EMAIL:       liuenze6516@gmail.com
#+DATE:        2018-05-22 Tue
#+URI:         /work/%y/%m/%d/完整的票务系统
#+KEYWORDS:    piaoniu
#+TAGS:        piaoniu
#+LANGUAGE:    en
#+OPTIONS:     H:2 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: piaoniu

* 整体目标

1. 有基础的配置项目, 出票，销售，验票功能
2. 其他日常的涉及到票务, 销售，运营，分销, 对账相关的操作
3. 最终呈现为一个主办愿意以自己名义外推/对接的系统

* 用户和场景
** [2/4] 为了制作项目，用于销售, 希望
  - [X] 能上 *选座/非选座* 项目
  - [X] 能上 *指定日期/展览通票/平日周末* 等不同场次, 可以划分 *不同的票版/票价*
  - [ ] 能上 *预售/正价* 票，从而在不同时间不同售价
  - [ ] 能上 *纸质票/电子票*
** [0/6] 为了能够直接销售, 沉淀用户, 支持各种运营活动, 且不依赖于某一平台, 希望
  - [ ] *有自己的销售系统, 能够支持用户，商品，交易，支付, 订单, 优惠功能*
  - [ ] 用户可以通过 pc, m 站, app, 小程序 等地址访问
  - [ ] 能有 *运营活动*, 比如 *套票*, *满立减*, *折扣* , *秒杀*, *限时优惠* 等
  - [ ] 能有用户级别，会员积分权益等
  - [ ] 能够通过短信触达到会员，通知最新的项目/优惠信息
  - [ ] 支持购物车的功能
** [4/6]为了能扩大销售渠道，希望
  - [X] 能有分销管理功能
  - [X] 能有对接系统分销渠道的功能
  - [X] 可以支持仅有部分库存的分销
  - [ ] 可以支持电子票&纸质票的分销
  - [X] 能针对不同渠道有不同的返点/售价，用于可以激励渠道等
  - [ ] 能支持多级渠道，比如多一级服务商，服务商管理下级渠道
** [2/2] 为了能方便和渠道方结算，平台方结算，知晓项目销售情况, 希望
  - [X] 能看到项目报表, 场次报表
  - [X] 能够指定项目给渠道方/场馆方看到对应的报表
** [2/3] 为了能让票务代理方销售，希望
  - [X] 能支持电子票对接, *直接/提供凭证给票代* 发送给用户
  - [ ] 能支持纸质票发货流程对接（由主办自行发货)
  - [X] 能支持批量打印纸质票提供给票务代理方 *主办打票或者票代自行出票*
** [3/5] 为了能保障用户购票后进场，验证购票真实性, 希望
  - [X] 能够验证票品有效性，不能重复验证
  - [ ] 能够保障稳定和效率
  - [X] 能够支持身份证，纸质票，电子票二维码进场
  - [ ] 能够支持现场取票
  - [X] 在他方票务系统未对接的情况下，有办法 hack 或者导码或者其他合作形式, *验证其他票代提供的凭证*
** [2/2] (班夫项目) 为了节约人工操作成本，希望
  - [X] 能符合一定规则(销售量超过 50%)，自动开售新场次
  - [X] 多场套票选座可以系统按规则自动分配座位
** [2/2] 为了提高用户体验，希望
  - [X] 现场用户可以扫码查看订单
  - [X] 临演前可以发放提醒通知用户
** [0/2]为了满足公安要求，希望
  - [ ] 系统能有大型项目经验，符合安防和稳定要求
  - [ ] 能够帮助项目通过公安检查


* 功能清单


* 现有系统
